{
  "_name_or_path": "microsoft/swin-tiny-patch4-window7-224",
  "architectures": [
    "SwinForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "depths": [
    2,
    2,
    6,
    2
  ],
  "drop_path_rate": 0.1,
  "embed_dim": 96,
  "encoder_stride": 32,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "use_amazed",
    "1": "use_amused",
    "2": "use_angry",
    "3": "use_annoyed",
    "4": "use_ashamed",
    "5": "use_bored",
    "6": "use_calm",
    "7": "use_confused",
    "8": "use_desiring",
    "9": "use_disappointed",
    "10": "use_disgusted",
    "11": "use_distressed",
    "12": "use_doubtful",
    "13": "use_embarrassed",
    "14": "use_excited",
    "15": "use_furious",
    "16": "use_happy",
    "17": "use_loved",
    "18": "use_melancholic",
    "19": "use_pleased",
    "20": "use_proud",
    "21": "use_sad",
    "22": "use_scared",
    "23": "use_sleepy",
    "24": "use_surprised",
    "25": "use_terrified",
    "26": "use_thoughtful",
    "27": "use_tired",
    "28": "use_victorious",
    "29": "use_worried"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "label2id": {
    "use_amazed": 0,
    "use_amused": 1,
    "use_angry": 2,
    "use_annoyed": 3,
    "use_ashamed": 4,
    "use_bored": 5,
    "use_calm": 6,
    "use_confused": 7,
    "use_desiring": 8,
    "use_disappointed": 9,
    "use_disgusted": 10,
    "use_distressed": 11,
    "use_doubtful": 12,
    "use_embarrassed": 13,
    "use_excited": 14,
    "use_furious": 15,
    "use_happy": 16,
    "use_loved": 17,
    "use_melancholic": 18,
    "use_pleased": 19,
    "use_proud": 20,
    "use_sad": 21,
    "use_scared": 22,
    "use_sleepy": 23,
    "use_surprised": 24,
    "use_terrified": 25,
    "use_thoughtful": 26,
    "use_tired": 27,
    "use_victorious": 28,
    "use_worried": 29
  },
  "layer_norm_eps": 1e-05,
  "mlp_ratio": 4.0,
  "model_type": "swin",
  "num_channels": 3,
  "num_heads": [
    3,
    6,
    12,
    24
  ],
  "num_layers": 4,
  "out_features": [
    "stage4"
  ],
  "out_indices": [
    4
  ],
  "patch_size": 4,
  "path_norm": true,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "stage_names": [
    "stem",
    "stage1",
    "stage2",
    "stage3",
    "stage4"
  ],
  "torch_dtype": "float32",
  "transformers_version": "4.34.1",
  "use_absolute_embeddings": false,
  "window_size": 7
}
